using System.Collections;
using WebShop.Data.Models;
using System.Collections.Generic;

/*************************************************************************
**************************************************************************

    Интерфейс представляет ссылочный тип, который может определять некоторый 
функционал - набор методов и свойств без реализации. Затем этот функционал 
реализуют классы и структуры, которые применяют данные интерфейсы.
    
https://metanit.com/sharp/tutorial/3.9.php

************************************************************************
************************************************************************/

namespace WebShop.Data.Interfaces
{
    public interface ICarsCategory
    {
        IEnumerable<Category> AllCategories { get; }
    }
}